test/cpu_1_queue_1024_chunk_1024.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        pre-fork
Server Hostname:        localhost
Server Port:            8001

Document Path:          /
Document Length:        0 bytes

Concurrency Level:      100
Time taken for tests:   8.531 seconds
Complete requests:      50000
Failed requests:        0
Non-2xx responses:      50000
Total transferred:      5350000 bytes
HTML transferred:       0 bytes
Requests per second:    5860.79 [#/sec] (mean)
Time per request:       17.063 [ms] (mean)
Time per request:       0.171 [ms] (mean, across all concurrent requests)
Transfer rate:          612.41 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       6
Processing:     3   17   1.4     17      34
Waiting:        3   17   1.4     17      34
Total:          7   17   1.4     17      37

Percentage of the requests served within a certain time (ms)
  50%     17
  66%     18
  75%     18
  80%     18
  90%     18
  95%     19
  98%     19
  99%     19
 100%     37 (longest request)