test/cpu_4_queue_1024_chunk_1024.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        pre-fork
Server Hostname:        localhost
Server Port:            8001

Document Path:          /
Document Length:        0 bytes

Concurrency Level:      100
Time taken for tests:   3.814 seconds
Complete requests:      50000
Failed requests:        0
Non-2xx responses:      50000
Total transferred:      5350000 bytes
HTML transferred:       0 bytes
Requests per second:    13107.91 [#/sec] (mean)
Time per request:       7.629 [ms] (mean)
Time per request:       0.076 [ms] (mean, across all concurrent requests)
Transfer rate:          1369.67 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       7
Processing:     1    8   1.0      7      24
Waiting:        1    7   1.0      7      23
Total:          3    8   1.0      7      24
WARNING: The median and mean for the total time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      8
  75%      8
  80%      8
  90%      8
  95%      9
  98%     11
  99%     11
 100%     24 (longest request)