test/cpu_4_queue_1024_chunk_256.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        pre-fork
Server Hostname:        localhost
Server Port:            8001

Document Path:          /
Document Length:        0 bytes

Concurrency Level:      100
Time taken for tests:   3.884 seconds
Complete requests:      50000
Failed requests:        2
   (Connect: 0, Receive: 1, Length: 0, Exceptions: 1)
Non-2xx responses:      49999
Total transferred:      5349893 bytes
HTML transferred:       0 bytes
Requests per second:    12871.99 [#/sec] (mean)
Time per request:       7.769 [ms] (mean)
Time per request:       0.078 [ms] (mean, across all concurrent requests)
Transfer rate:          1345.00 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       8
Processing:     0    8   1.2      8      23
Waiting:        0    7   1.1      8      23
Total:          1    8   1.1      8      29

Percentage of the requests served within a certain time (ms)
  50%      8
  66%      8
  75%      8
  80%      8
  90%      9
  95%      9
  98%     10
  99%     11
 100%     29 (longest request)