test/cpu_4_queue_1024_chunk_512.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        pre-fork
Server Hostname:        localhost
Server Port:            8001

Document Path:          /
Document Length:        0 bytes

Concurrency Level:      100
Time taken for tests:   3.880 seconds
Complete requests:      50000
Failed requests:        0
Non-2xx responses:      50000
Total transferred:      5350000 bytes
HTML transferred:       0 bytes
Requests per second:    12887.06 [#/sec] (mean)
Time per request:       7.760 [ms] (mean)
Time per request:       0.078 [ms] (mean, across all concurrent requests)
Transfer rate:          1346.60 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       7
Processing:     2    8   0.8      8      20
Waiting:        1    8   0.8      8      20
Total:          4    8   0.8      8      20

Percentage of the requests served within a certain time (ms)
  50%      8
  66%      8
  75%      8
  80%      8
  90%      8
  95%      9
  98%     10
  99%     11
 100%     20 (longest request)