test/cpu_4_queue_512_chunk_1024.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        pre-fork
Server Hostname:        localhost
Server Port:            8001

Document Path:          /
Document Length:        0 bytes

Concurrency Level:      100
Time taken for tests:   3.870 seconds
Complete requests:      50000
Failed requests:        0
Non-2xx responses:      50000
Total transferred:      5350000 bytes
HTML transferred:       0 bytes
Requests per second:    12918.45 [#/sec] (mean)
Time per request:       7.741 [ms] (mean)
Time per request:       0.077 [ms] (mean, across all concurrent requests)
Transfer rate:          1349.88 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       9
Processing:     1    8   1.1      7      26
Waiting:        1    8   1.1      7      26
Total:          3    8   1.1      7      30

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      8
  75%      8
  80%      8
  90%      9
  95%      9
  98%     11
  99%     12
 100%     30 (longest request)