test/cpu_4_queue_64_chunk_1024.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        pre-fork
Server Hostname:        localhost
Server Port:            8001

Document Path:          /
Document Length:        0 bytes

Concurrency Level:      100
Time taken for tests:   4.320 seconds
Complete requests:      50000
Failed requests:        0
Non-2xx responses:      50000
Total transferred:      5350000 bytes
HTML transferred:       0 bytes
Requests per second:    11573.62 [#/sec] (mean)
Time per request:       8.640 [ms] (mean)
Time per request:       0.086 [ms] (mean, across all concurrent requests)
Transfer rate:          1209.35 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1  34.5      0    1032
Processing:     0    7  63.7      5    3302
Waiting:        0    6  63.7      5    3302
Total:          0    8  89.0      5    4313

Percentage of the requests served within a certain time (ms)
  50%      5
  66%      5
  75%      5
  80%      6
  90%      6
  95%      7
  98%      9
  99%     12
 100%   4313 (longest request)