test/ngin1x.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.10.3
Server Hostname:        localhost
Server Port:            8002

Document Path:          /
Document Length:        612 bytes

Concurrency Level:      100
Time taken for tests:   1.810 seconds
Complete requests:      50000
Failed requests:        0
Total transferred:      42700000 bytes
HTML transferred:       30600000 bytes
Requests per second:    27619.61 [#/sec] (mean)
Time per request:       3.621 [ms] (mean)
Time per request:       0.036 [ms] (mean, across all concurrent requests)
Transfer rate:          23034.32 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       9
Processing:     2    3   0.7      3      14
Waiting:        2    3   0.7      3      14
Total:          3    4   0.9      3      20
WARNING: The median and mean for the total time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      3
  75%      4
  80%      4
  90%      4
  95%      5
  98%      5
  99%      6
 100%     20 (longest request)