test/nginx.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.10.3
Server Hostname:        localhost
Server Port:            8002

Document Path:          /
Document Length:        612 bytes

Concurrency Level:      100
Time taken for tests:   1.654 seconds
Complete requests:      50000
Failed requests:        0
Total transferred:      42700000 bytes
HTML transferred:       30600000 bytes
Requests per second:    30235.10 [#/sec] (mean)
Time per request:       3.307 [ms] (mean)
Time per request:       0.033 [ms] (mean, across all concurrent requests)
Transfer rate:          25215.60 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.6      1       4
Processing:     0    2   0.9      2       9
Waiting:        0    2   1.0      2       8
Total:          0    3   0.6      3      11

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      3
  75%      4
  80%      4
  90%      4
  95%      4
  98%      5
  99%      5
 100%     11 (longest request)